# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и
# выполняющую их деление.
# Числа запрашивать у пользователя,
# предусмотреть обработку ситуации деления на ноль.

def divisions(a, b):
    if b == 0:
        return "Ошибка: Делить на ноль нельзя"
    else:
        return a / b


try:
    ans = float(input("Введите первое число: "))
    ans2 = float(input("Введите второе число: "))
    print(divisions(ans, ans2))
except Exception as ex:
    print(ex)
