# 7. Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
# название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями,
# а также словарь со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.

import json

json_d = {}
json_d2 = {} #"""словарь для подсчета среднего значения- нет минусов"""
with open('taskfile7.txt', "r") as f_obj:
    content = f_obj.read().splitlines()
    for line in content:
        key, value = line.split()[0], (int(line.split()[2])-int(line.split()[3]))
        json_d[key] = value
        if value > 0:
            json_d2[key] = value


json_d2 = {"average_profit": round(sum(json_d2.values()) / len(json_d2.keys()),2)}

json_l = [json_d, json_d2]


print(json_l)

with open("task7.json", "w") as write_f:
    json.dump(json_l, write_f)