# 2. Представлен список чисел. Необходимо вывести элементы исходного списка,
# значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

# решение обычным методом
l =[300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

imax = l[0]
new_l = []
for i in l:
    if i > imax:
        new_l.append(i)
    imax = i

print(new_l)

# решение генератором списка
l =[300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
imax = l[0]
new_l = []
a = [el for el in l if el > l[l.index(el)-1]]
print(a)
"""Не разобрался как не выводить первый элемент"""
