# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

try:
    s = input("Введите строку из нескольких слов ")
except Exception as ex:
    print(ex)

l = s.split()

n = 1
for i in l:
    print(f"{n}. {i[:10].capitalize()}")
    n = n + 1

# print(s[:10])

# print(l)

# s = "Привет, какие у тебя дела с Марселласуоллесом?"
# s = input("Введите строку из нескольких слов ")