# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

season_dict = {"1": "Зима",
               "2": "Зима",
               "3": "Весна",
               "4": "Весна",
               "5": "Весна",
               "6": "Лето",
               "7": "Лето",
               "8": "Лето",
               "9": "Осень",
               "10": "Осень",
               "11": "Осень",
               "12": "Зима",
               }
# print(season_dict["1"])


try:
    a = input("Введите число месяца ")
    print(season_dict[a])
except:
    print("Вы ввели число больше 12 или слово")

## Сделать с list черех фор