# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

season_dict = {"Январь": "Зима",
               "Февраль": "Зима",
               "Март": "Весна",
               "Апрель": "Весна",
               "Май": "Весна",
               "Июнь": "Лето",
               "Июль": "Лето",
               "Август": "Лето",
               "Сентябрь": "Осень",
               "Октябрь": "Осень",
               "Ноябрь": "Осень",
               "Декабрь": "Зима",
               }
season_dict2 = {"1": "Январь",
                "2": "Февраль",
                "3": "Март",
                "4": "Апрель",
                "5": "Май",
                "6": "Июнь",
                "7": "Июль",
                "8": "Август",
                "9": "Сентябрь",
                "10": "Октябрь",
                "11": "Ноябрь",
                "12": "Декабрь",
                }

l = ('',
     "Январь", "Зима", "Февраль", "Зима", "Март", "Весна", "Апрель", "Весна", "Май", "Весна", "Июнь", "Лето", "Июль",
     "Лето",
     "Август", "Лето", "Сентябрь", "Осень", "Октябрь", "Осень", "Ноябрь", "Осень", "Декабрь", "Зима")

try:
    a = input("Введите число месяца ")
    x = season_dict2[a]
    print(season_dict[x], x) # Через словарь
    a = int(a) * 2
    print(l[a], l[a - 1]) # Через list
except:
    print("Вы ввели число больше 12 или слово")



