
# не сделал!!!!!!

# 4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

# a = int(input("Введите целое положительное число "))

a = 1231241

b = a // 10
c = a % 10
d = 0
# for i in len(a):
# print(len(str(a)))
# print(b,c)
# # c = a % 10
# for i in range(7):
#     c = a % 10
#     a = a // 10
#     print(c)
#     i = i+1
# #     # print(i)
#
#


if a < b:
    a = b


#
# if a < 0:
# #
# else: print("Вы ввели отрицательное число")
# print(type(a))
# print(a)